src/AccumulationRegisters/ОстаткиВалют/ОстаткиВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиВалют</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУчетная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ОстаткиВалют/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОтразитьПоступлениеВалюты(ДокументОбъект) Экспорт
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПеремещениеДенежныхСредств") 
		И ДокументОбъект.ВалютаНазначения <> ОбщийПовтИсп.ОсновнаяВалютаУчета() Тогда
		
		Сумма 	= ДокументОбъект.СуммаНазначения;
		Валюта 	= ДокументОбъект.ВалютаНазначения;
		
		Если ДокументОбъект.Валюта = ОбщийПовтИсп.ОсновнаяВалютаУчета() Тогда
			СуммаУчетная = ДокументОбъект.Сумма;
		Иначе
			СуммаУчетная = ПолучитьУчетнуюСуммуИзНабораЗаписей(ДокументОбъект.Движения.ОстаткиВалют);
		КонецЕсли;	
		
	ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПриходДенежныхСредств") 
		И ДокументОбъект.Валюта <> ОбщийПовтИсп.ОсновнаяВалютаУчета() Тогда 	
		
		Сумма 			= ДокументОбъект.Сумма;
		Валюта 			= ДокументОбъект.Валюта;
		СуммаУчетная 	= ДокументОбъект.Сумма * ДокументОбъект.Курс / ДокументОбъект.Кратность;
		
	Иначе
			
		Возврат;	
		
	КонецЕсли;	
	
	ОстаткиВалют = ДокументОбъект.Движения.ОстаткиВалют;
	
	Запись = ОстаткиВалют.ДобавитьПриход();
	Запись.Период 		= ДокументОбъект.Дата;
	Запись.Валюта 		= Валюта;
	Запись.Сумма 		= Сумма;
	Запись.СуммаУчетная = СуммаУчетная;
	
	ОстаткиВалют.Записывать = Истина;

КонецПроцедуры

Процедура ОтразитьСписаниеВалюты(ДокументОбъект) Экспорт
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПеремещениеДенежныхСредств") 
		И ДокументОбъект.ВалютаНазначения <> ОбщийПовтИсп.ОсновнаяВалютаУчета() Тогда
		
		Сумма 	= ДокументОбъект.Сумма;
		Валюта 	= ДокументОбъект.Валюта;
	
	ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РасходДенежныхСредств") 
		И ДокументОбъект.Валюта <> ОбщийПовтИсп.ОсновнаяВалютаУчета() Тогда 	
		
		Сумма 	= ДокументОбъект.Сумма;
		Валюта 	= ДокументОбъект.Валюта;
		
	Иначе
			
		Возврат;	
		
	КонецЕсли;
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных();
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиВалют");
		ЭлементБлокировки.УстановитьЗначение("Валюта", Валюта);
		Блокировка.Заблокировать();
		
	Исключение
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначения.СообщитьПользователю("Не удалось провести списание валюты!");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);		
		Возврат;
		
	КонецПопытки;

	СуммаУчетная = ПолучитьУчетнуюСуммуОстатка(ДокументОбъект.МоментВремени(), Валюта, Сумма);
	
	ОстаткиВалют = ДокументОбъект.Движения.ОстаткиВалют;
	
	Запись = ОстаткиВалют.ДобавитьРасход();
	Запись.Период 		= ДокументОбъект.Дата;
	Запись.Валюта 		= Валюта;
	Запись.Сумма 		= Сумма;
	Запись.СуммаУчетная = СуммаУчетная;
	
	ОстаткиВалют.Записывать = Истина;

КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьУчетнуюСуммуОстатка(МоментВремени, Валюта, СуммаВВалюте)
	
	// запросом выбрать остатки
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОстаткиВалютОстатки.СуммаОстаток,
	|	ОстаткиВалютОстатки.СуммаУчетнаяОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиВалют.Остатки(&Граница, Валюта = &Валюта) КАК ОстаткиВалютОстатки";
	Запрос.УстановитьПараметр("Граница", Новый Граница(МоментВремени,  ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Валюта", 	Валюта);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		УчетнаяСумма = 0;
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Если Выборка.СуммаОстаток > СуммаВВалюте Тогда
			УчетнаяСумма = Окр(Выборка.СуммаУчетнаяОстаток * СуммаВВалюте / Выборка.СуммаОстаток, 2);
		Иначе
			УчетнаяСумма = Выборка.СуммаУчетнаяОстаток;	
		КонецЕсли;		
			
	КонецЕсли;
			
	Возврат УчетнаяСумма;	
	
КонецФункции

Функция ПолучитьУчетнуюСуммуИзНабораЗаписей(НаборЗаписей)
	
	СуммаУчетная = 0;
	
	Для Каждого Запись Из НаборЗаписей Цикл
		
		Если Запись.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
			
			СуммаУчетная = Запись.СуммаУчетная;
			Прервать;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат СуммаУчетная;
	
КонецФункции	

#КонецОбласти

#КонецЕсли
